---
kind: method
id: M:Autodesk.Revit.DB.FilterStringEndsWith.#ctor
source: html/155a65a7-2d98-4127-1e7e-bc24ec26517f.htm
---
# Autodesk.Revit.DB.FilterStringEndsWith.#ctor Method

Constructs an instance of FilterStringEndsWith.

## Syntax (C#)
```csharp
public FilterStringEndsWith()
```